{
    "21658": "(a) A vehicle shall be driven as nearly as practical entirely within a single lane and shall not be moved from the lane until such movement can be made with reasonable safety.",
    "21804": "(a) The driver of any vehicle about to enter or cross a highway from any public or private property, or from an alley, shall yield the right-of-way to all traffic, as defined in Section 620, approaching on the highway close enough to constitute an immediate hazard, and shall continue to yield the right-of-way to that traffic until he or she can proceed with reasonable safety.",
    "22107": "No person shall turn a vehicle from a direct course or move right or left upon a roadway until such movement can be made with reasonable safety and then only after the giving of an appropriate signal in the manner provided in this chapter in the event any other vehicle may be affected by the movement.",
    "22350": "No person shall drive a vehicle upon a highway at a speed greater than is reasonable or prudent having due regard for weather, visibility, the traffic on, and the surface and width of, the highway, and in no event at a speed which endangers the safety of persons or property.",
    "21703": "The driver of a motor vehicle shall not follow another vehicle more closely than is reasonable and prudent, having due regard for the speed of such vehicle and the traffic upon, and the condition of, the roadway.",
    "20002": "(1) Locate and notify the owner or person in charge of that property of the name and address of the driver and owner of the vehicle involved and, upon locating the driver of any other vehicle involved or the owner or person in charge of any damaged property, upon being requested, present his or her driver’s license, and vehicle registration, to the other driver, property owner, or person in charge of that property.",
    "16028": "(a) Upon the demand of a peace officer pursuant to subdivision (b) or upon the demand of a peace officer or traffic collision investigator pursuant to subdivision (c), every person who drives a motor vehicle upon a highway shall provide evidence of financial responsibility for the vehicle that is in effect at the time the demand is made.",
    "California Vehicle Code 21658": "(a) A vehicle shall be driven as nearly as practical entirely within a single lane and shall not be moved from the lane until such movement can be made with reasonable safety.",
    "California Vehicle Code 20002": "(1) Locate and notify the owner or person in charge of that property of the name and address of the driver and owner of the vehicle involved and, upon locating the driver of any other vehicle involved or the owner or person in charge of any damaged property, upon being requested, present his or her driver’s license, and vehicle registration, to the other driver, property owner, or person in charge of that property.",
    "21950": "(a) The driver of a vehicle shall yield the right-of-way to a pedestrian crossing the roadway within any marked crosswalk or within any unmarked crosswalk at an intersection, except as otherwise provided in this chapter.",
    "20001": "(a) The driver of a vehicle involved in an accident resulting in injury to a person, other than himself or herself, or in the death of a person shall immediately stop the vehicle at the scene of the accident and shall fulfill the requirements of Sections 20003 and 20004.",
    "23103": "(a)  A person who drives a vehicle upon a highway in willful or wanton disregard for the safety of persons or property is guilty of reckless driving."
}