{
    "21658": "(a) A vehicle shall be driven as nearly as practical entirely within a single lane and shall not be moved from the lane until such movement can be made with reasonable safety.",
    "21804": "(a) The driver of any vehicle about to enter or cross a highway from any public or private property, or from an alley, shall yield the right-of-way to all traffic, as defined in Section 620, approaching on the highway close enough to constitute an immediate hazard, and shall continue to yield the right-of-way to that traffic until he or she can proceed with reasonable safety.",
    "22107": "No person shall turn a vehicle from a direct course or move right or left upon a roadway until such movement can be made with reasonable safety and then only after the giving of an appropriate signal in the manner provided in this chapter in the event any other vehicle may be affected by the movement.",
    "22350": "No person shall drive a vehicle upon a highway at a speed greater than is reasonable or prudent having due regard for weather, visibility, the traffic on, and the surface and width of, the highway, and in no event at a speed which endangers the safety of persons or property.",
    "21703": "The driver of a motor vehicle shall not follow another vehicle more closely than is reasonable and prudent, having due regard for the speed of such vehicle and the traffic upon, and the condition of, the roadway.",
    "20002": "(1) Locate and notify the owner or person in charge of that property of the name and address of the driver and owner of the vehicle involved and, upon locating the driver of any other vehicle involved or the owner or person in charge of any damaged property, upon being requested, present his or her driver’s license, and vehicle registration, to the other driver, property owner, or person in charge of that property.",
    "16028": "(a) Upon the demand of a peace officer pursuant to subdivision (b) or upon the demand of a peace officer or traffic collision investigator pursuant to subdivision (c), every person who drives a motor vehicle upon a highway shall provide evidence of financial responsibility for the vehicle that is in effect at the time the demand is made.",
    "California Vehicle Code 21658": "(a) A vehicle shall be driven as nearly as practical entirely within a single lane and shall not be moved from the lane until such movement can be made with reasonable safety.",
    "California Vehicle Code 20002": "(1) Locate and notify the owner or person in charge of that property of the name and address of the driver and owner of the vehicle involved and, upon locating the driver of any other vehicle involved or the owner or person in charge of any damaged property, upon being requested, present his or her driver’s license, and vehicle registration, to the other driver, property owner, or person in charge of that property.",
    "21950": "(a) The driver of a vehicle shall yield the right-of-way to a pedestrian crossing the roadway within any marked crosswalk or within any unmarked crosswalk at an intersection, except as otherwise provided in this chapter.",
    "20001": "(a) The driver of a vehicle involved in an accident resulting in injury to a person, other than himself or herself, or in the death of a person shall immediately stop the vehicle at the scene of the accident and shall fulfill the requirements of Sections 20003 and 20004.",
    "23103": "(a)  A person who drives a vehicle upon a highway in willful or wanton disregard for the safety of persons or property is guilty of reckless driving.",
    "23123.5": "(a) A person shall not drive a motor vehicle while holding and operating a handheld wireless telephone or an electronic wireless communications device unless the wireless telephone or electronic wireless communications device is specifically designed and configured to allow voice-operated and hands-free operation, and it is used in that manner while driving.",
    "21751": "On a two-lane highway, no vehicle shall be driven to the left side of the center of the roadway in overtaking and passing another vehicle proceeding in the same direction unless the left side is clearly visible and free of oncoming traffic for a sufficient distance ahead to permit such overtaking and passing to be completely made without interfering with the safe operation of any vehicle approaching from the opposite direction.",
    "21806(a)(1)": "(a) (1) Except as required under paragraph (2), the driver of every other vehicle shall yield the right-of-way and shall immediately drive to the right-hand edge or curb of the highway, clear of any intersection, and thereupon shall stop and remain stopped until the authorized emergency vehicle has passed.",
    "21801(a)": "(a) The driver of a vehicle intending to turn to the left or to complete a U-turn upon a highway, or to turn left into public or private property, or an alley, shall yield the right-of-way to all vehicles approaching from the opposite direction which are close enough to constitute a hazard at any time during the turning movement, and shall continue to yield the right-of-way to the approaching vehicles until the left turn or U-turn can be made with reasonable safety.",
    "21750": "(a) The driver of a vehicle overtaking another vehicle proceeding in the same direction shall pass to the left at a safe distance without interfering with the safe operation of the overtaken vehicle, subject to the limitations and exceptions set forth in this article.",
    "17200": "Where an uninsured owner or operator has obtained a judgment against or agreed to a settlement with the owner or operator of an insured motor vehicle based on the negligence of the insured owner or operator, the amount of the judgment or settlement payable by the insured or his or her insurer shall be reduced by the amount paid or payable to the insured owner or operator or occupants of the insured motor vehicles or their heirs or legal representatives from coverage provided by an uninsured motorist endorsement where the claim of the insured, the owner, or occupants of the insured motor vehicle and the uninsured motorist arise out of the same accident. If the insured or his or her insurer becomes entitled to a reduction, the reduction shall not exceed the amount of the settlement or judgment awarded the uninsured owner or operator.",
    "21800": "(a) The driver of a vehicle approaching an intersection shall yield the right-of-way to any vehicle which has entered the intersection from a different highway.",
    "21050": "Every person riding or driving an animal upon a highway has all of the rights and is subject to all of the duties applicable to the driver of a vehicle by this division and Division 10 (commencing with Section 20000), except those provisions which by their very nature can have no application.",
    "22108": "Any signal of intention to turn right or left shall be given continuously during the last 100 feet traveled by the vehicle before turning.",
    "21658(a)": "(a) A vehicle shall be driven as nearly as practical entirely within a single lane and shall not be moved from the lane until such movement can be made with reasonable safety.",
    "21800(a)": "(a) The driver of a vehicle approaching an intersection shall yield the right-of-way to any vehicle which has entered the intersection from a different highway.",
    "21453(a)": "(a) A driver facing a steady circular red signal alone shall stop at a marked limit line, but if none, before entering the crosswalk on the near side of the intersection or, if none, then before entering the intersection, and shall remain stopped until an indication to proceed is shown, except as provided in subdivision (b).",
    "20002(a)": "(a) The driver of any vehicle involved in an accident resulting only in damage to any property, including vehicles, shall immediately stop the vehicle at the nearest location that will not impede traffic or otherwise jeopardize the safety of other motorists.",
    "16020(a)": "(a) All drivers and all owners of a motor vehicle shall at all times be able to establish financial responsibility pursuant to Section 16021, and shall at all times carry in the vehicle evidence of the form of financial responsibility in effect for the vehicle.",
    "22106": "No person shall start a vehicle stopped, standing, or parked on a highway, nor shall any person back a vehicle on a highway until such movement can be made with reasonable safety.",
    "16000": "(a) The driver of a motor vehicle who is in any manner involved in an accident originating from the operation of the motor vehicle on a street or highway, or is involved in a reportable off-highway accident, as defined in Section 16000.1, that has resulted in damage to the property of any one person in excess of one thousand dollars ($1,000), or in bodily injury, or in the death of any person shall report the accident, within 10 days after the accident, either personally or through an insurance agent, broker, or legal representative, on a form approved by the department, to the office of the department at Sacramento, subject to this chapter. The driver shall identify on the form, by name and current residence address, if available, any person involved in the accident complaining of bodily injury.",
    "20008": " (a) The driver of a vehicle, other than a common carrier vehicle, involved in any accident resulting in injuries to or death of any person shall within 24 hours after the accident make or cause to be made a written report of the accident to the Department of the California Highway Patrol or, if the accident occurred within a city, to either the Department of the California Highway Patrol or the police department of the city in which the accident occurred. If the agency which receives the report is not responsible for investigating the accident, it shall immediately forward the report to the law enforcement agency which is responsible for investigating the accident.",
    "16028(a)": "(a) The driver of a vehicle intending to turn to the left or to complete a U-turn upon a highway, or to turn left into public or private property, or an alley, shall yield the right-of-way to all vehicles approaching from the opposite direction which are close enough to constitute a hazard at any time during the turning movement, and shall continue to yield the right-of-way to the approaching vehicles until the left turn or U-turn can be made with reasonable safety.",
    "21804(a)": "(a) The driver of any vehicle about to enter or cross a highway from any public or private property, or from an alley, shall yield the right-of-way to all traffic, as defined in Section 620, approaching on the highway close enough to constitute an immediate hazard, and shall continue to yield the right-of-way to that traffic until he or she can proceed with reasonable safety.",
    "16025(a)": "(1) Driver’s name and current residence address, driver’s license number, vehicle identification number, and current residence address of registered owner.",
    "16020": "(a) All drivers and all owners of a motor vehicle shall at all times be able to establish financial responsibility pursuant to Section 16021, and shall at all times carry in the vehicle evidence of the form of financial responsibility in effect for the vehicle.",
    "21456(b)": "(b) (1) A peace officer, as defined in Chapter 4.5 (commencing with Section 830) of Title 3 of Part 2 of the Penal Code, shall not stop a pedestrian for a violation of this section unless a reasonably careful person would realize there is an immediate danger of a collision with a moving vehicle or other device moving exclusively by human power."
}